Repository: mfglr/SolTake
Catalog: MobileApp/*_social_app/lib/l10n/app_*.arb
Languages: tr

# unexpected_exception
source: Something went wrong! Please try again.
tr: Bir şeyler yanlış gitt! Lütfen daha sonra tekrar deneyin!

source: votes
tr: oy

source: vote
tr: oy

# aprove_terms_of_use_page_title
source: Terms of Use
tr: Kullanıcı Sözleşmesi

# aprove_privacy_policy_page_title
source: Privacy Policy
tr: Gizlilik Sözleşmesi

# aprove_privacy_policy_page_checkbox_label
source: I have read and accept the privacy policy.
tr: Gizlilik sözleşmesini okudum ve kabul ediyorum.

# approve_terms_of_use_page_checkbox_label
source: I have read and accept the terms of use.
tr: Kullanıcı Sözleşmesini okudum ve kabul ediyorum.

# approve_policy_page_eror
source: You must approve the Privacy Policy and Terms of Use to continue!
tr: Devam etmek için Gizlilik Politikasını ve Kullanım Koşullarını onaylamanız gerekmektedir!

# approve_policy_page_button_content
source: Continue
tr: Devam Et

# login_form_email
source: Enter your email or username.
tr: Email addresinizi ya da kullanıcı adınızı giriniz.

# login_form_password
source: Enter your password
tr: Şifrenizi giriniz.

# login_form_button
source: Login
tr: Giriş Yap

# login_register_button
source: Register
tr: Kayıt Ol

# login_form_email_required_error
source: Email or username is required!
tr: Email ya da kullanıcı adı gerekli!

# login_page_diveder_or
source: or
tr: ya da

# face_book_login_button_error
source: Something went wrong! Please try again.
tr: Bir şeyler yanlış gitti! Lütfen tekrar deneyin.

# google_login_button_error
source: Something went wrong! Please try again.
tr: Bir şeyler yanlış gitti! Lütfen tekrar deneyin.

# register_button
source: Register
tr: Kayıt Ol

# register_email
source: Enter your email.
tr: Email addresinizi giriniz.

# register_password
source: Enter your password.
tr: Şifrenizi giriniz.

# register_password_confirmation
source: Confirm the password.
tr: Şifrenizi onaylayın.

# register_login_label
source: Do you have an account? Login.
tr: Zaten bir hesabınız var mı? Giriş Yapın.

# register_login_button
source: Login
tr: Giriş Yap

# verify_email_form_label
source: We have been sent a mail to confirm your email. Please type the code in the mail.
tr: Email hesabınızı onaylamanız için size bir mail gönderdik. Lütfen maildeki kodu yazınız.

# verify_email_form_code
source: Enter the code.
tr: Kodu giriniz.

# verify_email_form_button
source: Verify Email
tr: Emaili Onayla

# send_email_confirmation_mail_button_content
source: Resend Mail
tr: Tekrar Mail Gönder

# send_eamil_confirmation_mail_button_success
source: Email has been successfully send!
tr: Mail başarıyla gönderildi!

# send_eamil_confirmation_mail_button_label
source: Didn't you receive the email
tr: Mail gelmedi mi?

# logout_button_content
source: Logout
tr: Çıkış Yap

# show_app_dialog_cancel_button
source: Cancel
tr: İptal

# show_app_dialog_delete_button
source: Delete
tr: Sil

# show_logout_dialog_title
source: Log Out
tr: Çıkış Yap

# show_logout_dialog_content
source: Are you sure you want to log out?
tr: Çıkmak istediğine emin misin?

# show_logout_dialog_content_of_approve_button
source: Log Out
tr: Çıkış Yap

# show_remove_follower_dialog_title
source: Remove Follower
tr: Takipçiyi Kaldır

# show_remove_follower_dialog_content
source: Are you sure you want to remove the follower?
tr: Takipçiyi kaldırmak istediğine emin misin?

# show_remove_follower_dialog_content_of_approve_button
source: Remove
tr: Kaldır

# question_state_unsolved
source: Unsolved
tr: Çözümsüz

# question_state_solved
source: Solved
tr: Çözümlü

# display_question_likes
source: Likes
tr: Beğeni

# no_questions_abstract_items
source: No Questions
tr: Soru Yok

# question_item_popup_menu_delete_action
source: Delete
tr: Sil

# question_item_popup_menu_title
source: Delete Your Question
tr: Soruyu Sil

# question_item_popup_menu_description
source: Are your sure you want to delete your question?
tr: Bu soruyu silmek istediğine emin misin?

# display_exam_questions_page_exam
source: Exam
tr: Sınav

# display_question_likes_page_likes
source: Likes
tr: Beğeniler

# display_question_page_title
source: ' s question
tr: adlı kullanıcının sorusu

# display_search_questions_page_title
source: Filtered questions
tr: Filtrelenmiş Sorular

# display_subject_questions_page_title
source: Subject
tr: Ders

# display_topic_questions_page_title
source: Topic
tr: Konu

# display_user_questions_page_title
source: 's questions
tr: adlı kullanıcının soruları

# display_user_solved_questions_page_title
source: 's solved questions
tr: adlı kullanıcının çözümlü soruları

# display_user_unsolved_questions_page_title
source: 's unsolved questions
tr: adlı kullnıcının çözümsüz soruları

# display_comment_likes_button_likes
source: Likes
tr: Beğeni

# hiide_replies_button
source: Hide replies
tr: Gizle

# reply_comment_button
source: Reply
tr: Yanıtla

# comment_field_widget_reply_content
source: You are replying to
tr: Yanıt verdiğin kişi

# comment_field_widget_hint_text
source: Leave a comment...
tr: Yorum yap...

# comment_popup_menu_delete_action
source: Delete
tr: Sil

# comment_popup_menu_title
source: Delete Your Comment
tr: Yorumu Sil

# comment_popup_menu_description
source: Are your sure you want to delete your comment?
tr: Yorumu silmek istediğine emin misin?

# no_comments_title
source: No Comments
tr: Hiç Yorum Yok

# no_comments_description
source: Be the first to comment.
tr: İlk yorumu yapan sen ol.

# display_comment_likes_page_title
source: Likes
tr: Beğeniler

# notifications_page_title
source: Notifications
tr: Bildirimler

# no_notifications_content
source: No Notifications
tr: Hiç Bildirim Yok

# select_exam_page_title
source: Select an exam
tr: Bir sınav seç

# select_subject_page_title
source: Select a subject
tr: Bir ders seç

# select_topics_page_title
source: Select topic
tr: Konu seç

# select_topics_page_label
source: Select topic
tr: Konu seç

# select_topics_page_about_question
source: Type somethings about the question...
tr: Soru hakkında bir şeyler yaz...

# select_topics_page_topic_error_message
source: You can't select up to 3 topics per question
tr: Bir soru için en fazla 3 konu ekleyebilirsin!

# select_topics_page_add_images_button
source: Add Images
tr: Resim ekle

# add_question_images_page_error_message
source: You can upload up to 3 images per a question!
tr: Bir soru için en fazla 3 resim yükleyebilirsiniz.

# add_question_images_page_title
source: Upload Images
tr: Resim Yükle

# add_question_image_page_label
source: Upload images to make your question more visible to other users.
tr: Sorunuzun daha çok dikkat çekebilmesi için resim yükleyiniz.

# add_question_image_page_create_question_button
source: Create Question
tr: Soruyu oluştur

# no_solution_image_widget_label
source: Upload an image to make your solution stand out more.
tr: Çözümünüzün daha çok dikkat çekmesi için resim yükleyin.

# no_solution_image_widget_add_photo_button
source: Add a photo
tr: Resim ekleyin.

# add_solution_images_page_error
source: You can't upload up to 3 images per a solution!
tr: Bir çözüm için en fazla 3 resim yükleyebilirsiniz!

# add_solution_images_page_title
source: Create a Solution
tr: Çözüm oluştur

# add_solution_images_page_continue_button
source: Continue
tr: Devam Et

# add_solution_content_page_text_field
source: Type somethings about your solution...
tr: Çözümün hakkında bir şeyler yaz...

# add_solution_content_page_title
source: Type somethings
tr: Bir şeyler yaz

# add_solution_content_page_content_error
source: You have to type a content or upload at least an image!
tr: Çözüm hakkında bir şeyler yazmalı ya da en az bir resim yüklemelisin!

# add_solution_content_page_content_length_error
source: The content is too long
tr: İçerik çok uzun!

# add_solution_content_page_create_solution_button
source: Create Solution
tr: Çözümü oluştur

# edit_user_field_widget_button_text
source: Edit
tr: Düzenle

# edit_name_page_title
source: Edit Name
tr: İsmini Düzenle

# edit_user_name_page_title
source: Edit Username
tr: Kullanıcı Adını Düzenle

# edit_user_name_page_invalid_characters
source: Invalid chracter!
tr: Geçersiz karekter!

# edit_biography_page_title
source: Edit Biography
tr: Biyografini Düzenle

# edit_biography_page_hint_text
source: Type somethings about you. Which exam are you preparing for?
tr: Kendin hakkında bir şeyler yaz. Hangi sınava hazırlanıyorsun?

# edit_profile_page_title
source: Edit Your Profile
tr: Profilini Düzenle

# edit_profile_page_user_name_label
source: User Name
tr: Kullanıcı Adı

# edit_profile_page_name_label
source: Name
tr: İsim

# edit_profile_page_biography_label
source: Biography
tr: Biyografi

# update_profile_photo_modal_camera
source: Camera
tr: Kamera

# update_profile_phot_modal_remove_button
source: Remove
tr: Kaldır

# user_followeds_page_title
source: 's followings
tr: adlı kullanıcının takip ettikleri

# user_followeds_page_no_followings
source: No Followings
tr: Takip Edilen Yok

# user_followers_page_title
source: 's followers
tr: adlı kullanıcının takipçileri

# user_followers_page_no_followers
source: No Followers
tr: Takipçi Yok

# user_page_label_all
source: all
tr: hepsi

# user_page_label_solved
source: solved
tr: çözümlü

# user_page_label_unsolved
source: unsolved
tr: çözümsüz

# message_items_new_messages
source: new messages
tr: yeni mesaj

# message_items_new_message
source: new message
tr: yeni mesaj

# conversation_page_message_field_hint_text
source: Message ...
tr: Mesaj ...

# conversation_page_delete_cancel_button
source: Cancel
tr: İptal

# conversation_page_delete_button
source: Delete
tr: Sil

# conversation_page_delete_dialog_title
source: Delete Your Messages
tr: Mesajları Sil

# conversation_page_delete_dialog_content
source: Are you sure you want to delete your messages?
tr: Mesajları silmek istediğine emin misin?

# messages_home_page_title
source: Messages
tr: Mesajlar

# create_message_images_page_image_count_error
source: You cannot upload more than 2 images in a message.
tr: Bir mesaja 2' den fazla resim yükleyemezsiniz.

# conversation_item
source: Image ...
tr: Resim ...

# create_message_images_page_message_field_hint_text
source: Message ...
tr: Mesaj ...

# comment_liked_notification_item_content
source: Your comment has been liked.
tr: Yorumun beğenildi.

# comment_replied_notification_content
source: Your comment has been replied.
tr: Yorumuna yanıt geldi.

# question_comment_created_notification_item_content
source: Your question has been commented.
tr: Soruna yorum yapıldı.

# question_liked_notification_item_content
source: Your question has been liked.
tr: Sorun beğenildi.

# question_solved_notification_item_content
source: YAY!!!🥳 Your question has been solved. Click to display the solution.
tr: YAŞASIN!!!🥳 Sorun çözüldü. Çözümü görmek için tıkla.

# solution_comment_created_notification_item_content
source: Your solution has been commented.
tr: Çözümüne yorum yapıldı.

# solution_created_notification_item_content
source: A solution has been created for your question.😊👊 Click to check the solution.
tr: Sorun için bir çözüm oluşturuldu!😊👊 Çözümü kontrol etmek için tıklayın.

# solution_marked_as_correct_notification_item_context
source: Your solution has been marked as correct.👏👏👏
tr: Çözümün doğru olarak işaretlendi.👏👏👏

# solution_marked_as_incorrect_notification_imte_content
source: Your solution has been marked as incorrect!😓
tr: Çözümün yanlış olarak işaretlendi!😓

# solutin_was_downvoted_notification_item_content
source: Oh No🙁 Your solution has been downvoted!👎
tr: Olamaz🙁 Çözümün olumsuz oy aldı!👎

# solution_was_upvoted_notification_item_content
source: Hey!!! Your solution has been upvoted!👍
tr: Hey!!! Çözümün olumlu oy aldı!👍

# user_followed_notification_item_content
source: You have a new follower.
tr: Yeni takipçin var.

# user_tagged_in_comment_item_content
source: You have been tagged in a comment.
tr: Bir yoruma etiketlendin.

# search_question_widget_select_exam
source: Select Exam
tr: Sınav Seç

# search_question_widget_select_subject
source: Select Subject
tr: Ders Seç

# search_question_widget_select_topic
source: Select Topic
tr: Konu Seç

# search_users_widget_search_field_hint_text
source: Search
tr: Ara

# search_page_label_question
source: questions
tr: sorular

# search_page_label_user
source: users
tr: kullanıcılar

# image_not_font_widget_content
source: Image not Found.
tr: Resim bulunamadı.

# display_question_correct_solutions_page_title
source: Correct solutions
tr: Doğru çözümler

# display_question_correct_solutions_page_no_solutions
source: No Correct Solutions
tr: Doğru Çözüm Yok

# display_question_pending_solutions_page_title
source: Pending solutions
tr: Onay bekleyen çözümler

# display_question_pending_solutions_page_no_solutions
source: No Pending Solutions
tr: Onay Bekleyen Çözüm Yok

# display_question_solutions_page_title
source: Question Solutions
tr: Sorunun Çözümleri

# display_solutions_downvote_page_title
source: Downvotes
tr: Olumsuz Oylar

# display_solutions_page_title
source: 's solutions
tr: adlı kullanıcıların çözümleri

# display_solution_upvotes_title
source: Upvotes
tr: Olumlu oylar

# display_video_solutions_page_title
source: Video Solutions
tr: Video Çözümler

# display_video_solutions_page_no_solutions
source: No Video Solutions
tr: Video Çözüm Yok

# display_question_solutions_page_no_correct_solutins
source: No Correct Solutions
tr: Doğru Çözüm Yok

# display_question_solutions_page_no_pending_solutions
source: No Pending Solutions
tr: Onaylanmamış Çözüm Yok

# display_question_solutions_page_no_incorrect_solutions
source: No Incorrect Solutions
tr: Yanlış Çözüm Yok

# create_question_speed_dial_video_solution_label
source: Create Video Solution
tr: Video Çözüm Oluştur

# create_question_speed_dial_image_solution_label
source: Upload Images
tr: Resim Yükle

# no_solutions_widget_conten1
source: No Solutions Yet!!!😢
tr: Henüz Çözüm Yok!!!😢

# no_solutions_widget_conten2
source: Dont Worry! Your question will be solved soon.🤞
tr: Endişelenme! Sorun Yakında Çözülecektir.🤞

# no_solutions_widget_conten3
source: No Solutions Yet!!!😢
tr: Henüz Çözüm Yok!!!😢

# no_solutions_widget_conten4
source: Be the first to solve this question.👍
tr: Soruyu çözen ilk sen ol!👍

# solution_popup_menu_titte
source: Delete Your Solution
tr: Çözümü Sil

# solution_popup_menu_content
source: Are you sure you want to delete your solution?
tr: Çözümü silmek istediğine emin misin?

# solution_popup_menu_delete_button
source: Delete
tr: Sil

# mark_solution_as_correct_button_content
source: Correct
tr: Doğru

# mark_solution_as_incorrect_button_content
source: Incorrect
tr: Yanlış

# follow_button_widget_unfollow
source: unfollow
tr: takip etme

# follow_button_widget_follow
source: follow
tr: takip et

# message_button_widget_content
source: message
tr: mesaj

# profile_edit_button_content
source: Edit your profile
tr: Profilini düzenle

# remove_follower_button_content
source: Remove
tr: Kaldır

# user_info_header_widget_questions
source: Questions
tr: Sorular

# user_info_header_widget_followers
source: Followers
tr: Takipçi

# user_info_header_widget_followings
source: Followings
tr: Takip

# profile_menu_page_title
source: My Account
tr: Hesabım

# profile_menu_page_saves_item
source: Questions Saved
tr: Kaydedilen Sorular

# profile_menu_page_logout_item
source: Logout
tr: Çıkış Yap

# delete_account_menu_item_content
source: Delete My Account
tr: Hesabımı Sil

# delete_account_menu_item_app_dialog_title
source: Delete Your Account
tr: Hesabını Sil

# delete_account_menu_item_app_dialog_content
source: Are you sure you want to delete your acccount!. We are so sorry to see you leave us!
tr: Hesabını silmek istediğine emin misi?. Aramızdan ayrıldığınız için çok üzgünüz!

# display_saved_solutions_menu_item_name
source: Saved Solutions
tr: Kaydedilen Çözümler

# change_language_menu_item_name
source: Change Language of The Application
tr: Uygulamanın dilini değiştir.

# display_abstract_saved_questions_page_title
source: Questions Saved
tr: Kaydedilen Sorular

# display_abstract_saved_solutions_page_title
source: Solutions Saved
tr: Kaydedilen Çözümler

# display_abstract_saved_solutions_page_no_solutions_content
source: No Solutions Saved
tr: Kaydedilen Çözüm yok

# display_saved_solutions_page_title
source: Solutions Saved
tr: Kaydedilen Çözümler

# display_saved_question_page_title
source: Questions Saved
tr: Kaydedilen Sorular

# create_conversation_page_title
source: Create a new conversation
tr: Yeni sohbet başlat

# message_home_page_delete_conversations_title
source: Delete Conversations
tr: Sohbetleri sil

# message_home_page_delete_conversations_content
source: Are you sure you want to delete the conversations?
tr: Sohbetleri silmek istediğine emin misin?

# message_home_page_content_aprove_button
source: delete
tr: sil

# delete_conversations_button
source: delete
tr: sil

# cancel_deletion_of_conversations_button
source: cancel
tr: iptal

# take_video_page_duration_exception
source: The duration of the video must be shorter than 120 seconds
tr: Videonun süresi 120 saniyeden az olmalıdır!

# create_video_solution_page_title
source: Create Video Solution
tr: Video Çözüm Oluştur

# create_video_solution_page_new_video_content
source: New Video
tr: Yeni Video

# create_video_solution_page_content1
source: Record a Video
tr: Video Çek

# create_video_solution_page_content2
source: Explain your solution by recording a video.
tr: Çözümünü video çekerek anlat!

# create_video_solution_page_no_video_error
source: You need to upload a video in order to proceed.
tr: İlerleyebilmek için bir video yüklemelisin!

# create_video_solution_page_contiune_button_content
source: Continue
tr: Devam Et

# uploading_solution_abstract_item
source: Processing
tr: İşleniyor

# uploading_solution_abstract_item_failed_content
source: Failed! Click to try again.
tr: Başarısız! Tekrar denemek için tıklayınız.

# uploading_circle_processing
source: Processing
tr: İşleniyor

# uploading_circle_failed_content
source: Failed! Click to try again.
tr: Başarısız! Tekrar denemek için tıklayınız.

# update_page_app_button_content
source: Update App
tr: Uygulamayı Güncelle

# update_page_app_content
source: A new version available. You need to update the app to continue using it!
tr: Yeni sürüm mevcut. Uygulamayı kullanmaya devam edebilmek için güncellemelisiniz!
